snlkuharlocal/src/DataProcessors/ВозвратБракаМаркированногоТовара/ВозвратБракаМаркированногоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВозвратБракаМаркированногоТовара</name>
  <attributes>
    <name>ПричинаРекламации</name>
    <type>
      <types>CatalogRef.ПричиныРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРекламации</name>
    <type>
      <types>EnumRef.ВидыРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратныйДокумент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВозвратБрака</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ХКМПриход</name>
      <type>
        <types>DocumentRef.ХранилищеКодовМаркировки</types>
      </type>
    </attributes>
    <attributes>
      <name>Приход</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратныйДок</name>
      <type>
        <types>DocumentRef.РекламационнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРекламации</name>
      <type>
        <types>CatalogRef.ПричиныРекламаций</types>
      </type>
    </attributes>
    <attributes>
      <name>НачСтатус</name>
      <type>
        <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекСтатус</name>
      <type>
        <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХКМТек</name>
      <type>
        <types>DocumentRef.ХранилищеКодовМаркировки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекДок</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>МожноВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыРекламаций/ВидыРекламаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРекламаций</name>
  <enumValues>
    <name>Рекламация</name>
  </enumValues>
  <enumValues>
    <name>Вычерк</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыМарокУКонтаргента/СтатусыМарокУКонтаргента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМарокУКонтаргента</name>
  <enumValues>
    <name>Недосдача</name>
    <comment>Недосдача</comment>
  </enumValues>
  <enumValues>
    <name>Излишек</name>
    <comment>Излишек</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаМаркировки</name>
    <comment>Пример -Товар совпадает, код марки не совпадает</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ХранилищеКодовМаркировки/ХранилищеКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХранилищеКодовМаркировки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ПередачаКодовМаркировкиМП</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <basedOn>Document.МаркировкаОстатковТЦ</basedOn>
  <basedOn>Document.Претензия</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ВыкупИМ</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.Возврат1ИМ</types>
      <types>DocumentRef.МаркировкаОстатковТЦ</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.ПередачаКодовМаркировкиМП</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Претензия</types>
      <types>DocumentRef.ЗаказИМ</types>
      <types>DocumentRef.ОприходованиеТМЦ</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.ВозвратИМ</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупповыхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтучныхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланФакт</name>
    <type>
      <types>EnumRef.ПланФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоШтуквХКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <comment>Не нанесен</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ВозвратБракаМаркированногоТовара/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	// Вставить содержимое обработчика. 
	
	Если СтрДлина(СокрЛП(Данные)) > 30 и СтрНайти(Лев(СокрЛП(Данные),3),"01") > 0 Тогда //Отсканирована Марка
		СтрШтрихКодУпаковки = ПолучитьСсылкуШКУпаковки(Данные);
		ШтрихКодУпаковки = СтрШтрихКодУпаковки.СсылкаШКУпаковок;
		Если ЗначениеЗаполнено(ШтрихКодУпаковки) Тогда
			//+HELP-5136 20250522 Михайловский
			//вместо
			//СтрокаШтрихКодаУпаковки = Объект.ШтрихкодыУпаковок.Добавить();
			// 
			//рШапки = ОбщегоНазначения_Инт.ПолучитьРеквизитыШапки(ШтрихКодУпаковки, "Владелец Характеристика,Владелец.Владелец Номенклатура");
			// 
			//СтрокаШтрихКодаУпаковки.ШтрихкодУпаковки 	= ШтрихКодУпаковки;			 
			//СтрокаШтрихКодаУпаковки.Характеристика		= рШапки.Характеристика;
			//СтрокаШтрихКодаУпаковки.Номенклатура 		= рШапки.Номенклатура;
			// 
			//Данные = ПолучитьШКПоХарактеристике(рШапки.Характеристика);
			//Если Данные <> Неопределено Тогда 
			// 	РаботаСЭлементамиФормыКлиент.ВнешнееСобытиеШтрихкод(ЭтаФорма, Источник, Событие, Данные, ДобавлятьСертификаты);
			//КонецЕсли;
			
			НайдыВ = Объект.ВозвратБрака.НайтиСтроки(Новый Структура("ШКУпаковки", ШтрихКодУпаковки));
			Если НайдыВ.Количество() Тогда
				ОпНеНайденКИЗ(Данные,  "Сосканированая марка ЧЗ уже есть в таблице возвратов ");
			Иначе	
				СтрокаШтрихКодаУпаковки = Объект.ВозвратБрака.Добавить();
				
				//рШапки = ОбщегоНазначения_Инт.ПолучитьРеквизитыШапки(ШтрихКодУпаковки, "Владелец Характеристика,Владелец.Владелец Номенклатура");
				
				СтрокаШтрихКодаУпаковки.ШКУпаковки 	= ШтрихКодУпаковки;	
				СтрокаШтрихКодаУпаковки.КодМаркировки 	= СтрШтрихКодУпаковки.ШтрихКод;
				СтрСтат = ЗапросСтатусШКУпаковки(ШтрихКодУпаковки);
				СтрокаШтрихКодаУпаковки.Номенклатура = СтрСтат.Номенклатура;
				СтрокаШтрихКодаУпаковки.НачСтатус = СтрСтат.НачСтатус;
				СтрокаШтрихКодаУпаковки.ТекСтатус = СтрСтат.ТекСтатус;
				СтрокаШтрихКодаУпаковки.ХКМПриход = СтрСтат.ХКМПриход; 
				СтрокаШтрихКодаУпаковки.Приход = СтрСтат.Приход; 
				СтрокаШтрихКодаУпаковки.ХКМТек = СтрСтат.ХКМТек;
				СтрокаШтрихКодаУпаковки.ТекДок = СтрСтат.ТекДок;
				СтрокаШтрихКодаУпаковки.МожноВ = СтрСтат.МожноВ;
			КонецЕсли;
			//СтрокаШтрихКодаУпаковки.ХарактеристикаНоменклатуры		= рШапки.Характеристика;
			//СтрокаШтрихКодаУпаковки.Номенклатура 		= рШапки.Номенклатура;
			//
			//ДанныеЛШК = ПолучитьШКПоХарактеристике(рШапки.Характеристика);
			//Если ДанныеЛШК <> Неопределено Тогда 
			// 	РаботаСЭлементамиФормыКлиент.ВнешнееСобытиеШтрихкод(ЭтаФорма, Источник, Событие, ДанныеЛШК, ДобавлятьСертификаты);
			//КонецЕсли;
			
			//-HELP-5136 20250522 Михайловский		
		Иначе
			ОпНеНайденКИЗ(Данные,  "Сосканирована марка ЧЗ, но в справочнике штрихкодов упаковки не найдена ");
		КонецЕсли;
	Иначе
		//РаботаСЭлементамиФормыКлиент.ВнешнееСобытиеШтрихкод(ЭтаФорма, Источник, Событие, Данные, ДобавлятьСертификаты);
		ОпНеНайденКИЗ(Данные,  "Сосканированый ШК не распознан, допускается только сканирование марок ЧЗ ");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпНеНайденКИЗ(ШК, Сооб)
	Если Найти(ШК, РазделительGS1()) > 0 Тогда  //Марка с GS
		
		Марка = СтрЗаменить(ШК, РазделительGS1(),"<GS>");
		Марка = ?(Лев(Марка, 4) = "<GS>", Сред(Марка, 5), Марка);	
		
	ИначеЕсли Найти(ШК, "<GS>") > 0 Тогда //сканируем с экрана
		Марка = ШК;
		Марка = ?(Лев(Марка, 4) = "<GS>", Сред(Марка, 5), Марка);
	//ИначеЕсли СтрДлина(СокрЛП(ШК)) > 30 и СтрНайти(Лев(СокрЛП(ШК),3),"01") > 0 Тогда
	//	Марка = СокрЛП(ШК);  
	Иначе
		Марка = СокрЛП(ШК);	
	КонецЕсли;
	ПоказатьПредупреждение(, Сооб + Марка, 30);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСсылкуШКУпаковки(ШтрихКод) 
	Рез = Новый Структура;
	Если Найти(ШтрихКод, РазделительGS1()) > 0 Тогда  //Марка с GS
		//+HELP-3942 20250408 Михайловский
		//1-й символ chr(29) бывает
		//SGTIN = Лев(ШтрихКод, СтрНайти(Штрихкод,МаркировкаКлиентСервер.РазделительGS1())-1);
		//ШтрихКод = СтрЗаменить(ШтрихКод, МаркировкаКлиентСервер.РазделительGS1(),"<GS>");
		ШтрихКод = СтрЗаменить(ШтрихКод, РазделительGS1(),"<GS>");
		ШтрихКод = ?(Лев(ШтрихКод, 4) = "<GS>", Сред(ШтрихКод, 5), ШтрихКод);
		SGTIN = Лев(ШтрихКод, СтрНайти(ШтрихКод,"<GS>")-1);
		//-HELP-3942 20250408 Михайловский
	ИначеЕсли Найти(ШтрихКод, "<GS>") > 0 Тогда
		//+HELP-3942 20250408 Михайловский
		//1-й символ chr(29) бывает
		ШтрихКод = ?(Лев(ШтрихКод, 4) = "<GS>", Сред(ШтрихКод, 5), ШтрихКод);
		//-HELP-3942 20250408 Михайловский
		SGTIN = Лев(ШтрихКод, СтрНайти(ШтрихКод,"<GS>")-1);
	ИначеЕсли СтрДлина(СокрЛП(ШтрихКод)) > 30 и СтрНайти(Лев(СокрЛП(ШтрихКод),3),"01") > 0 Тогда //Отсканирована Марка но в формате ХЗ
		SGTIN = Лев(ШтрихКод, 31);
	КонецЕсли; 
	
	СсылкаШКУпаковок = ЗапросШКУпаковки(SGTIN);
	Рез.Вставить("SGTIN", SGTIN);
	Рез.Вставить("ШтрихКод", ШтрихКод);
	Рез.Вставить("СсылкаШКУпаковок", СсылкаШКУпаковок);
	Возврат Рез;
	//СсылкаШКУпаковок;		
КонецФункции

&НаСервереБезКонтекста
Функция ЗапросШКУпаковки(SGTIN)
	СсылкаШКУпаковки = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Наименование = &SGTIN" ;
	Запрос.УстановитьПараметр("SGTIN",SGTIN);
	Результат = запрос.Выполнить().Выбрать();
	
	
	Если Результат.Следующий() Тогда
		СсылкаШКУпаковки = Результат.Ссылка;
	КонецЕсли;
	Возврат СсылкаШКУпаковки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапросСтатусШКУпаковки(СсылкаШКУпаковки)
	Рез = Новый Структура; 
	Рез.Вставить("НачСтатус", Неопределено);
	Рез.Вставить("Номенклатура", Неопределено);
	Рез.Вставить("ТекСтатус", Неопределено);
	Рез.Вставить("ХКМПриход", Неопределено);
	Рез.Вставить("Приход", Неопределено);
	Рез.Вставить("ХКМТек", Неопределено);
	Рез.Вставить("ТекДок", Неопределено); 
	Рез.Вставить("МожноВ", Ложь);
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СтатусыКМ_Факт.Статус КАК Статус,
	|	СтатусыКМ_Факт.Номенклатура КАК Номенклатура,
	|	СтатусыКМ_Факт.ТипШК КАК ТипШК,
	|	СтатусыКМ_Факт.Регистратор КАК Регистратор,
	|	СтатусыКМ_Факт.Местонахождение КАК Местонахождение
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	|ГДЕ
	|	СтатусыКМ_Факт.ШтрихКодУпаковки = &ШтрихКодУпаковки
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыКМ_Факт.Период,
	|	СтатусыКМ_Факт.Регистратор.Дата";
	Запрос.УстановитьПараметр("ШтрихКодУпаковки",СсылкаШКУпаковки);
	Результат = запрос.Выполнить().Выбрать();
	к = 0;
	Пока Результат.Следующий() Цикл
		Если к = 0 Тогда
			Рез.НачСтатус = Результат.Статус;
			Рез.Номенклатура = Результат.Номенклатура; 
			Если ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
				Рез.ХКМПриход = Результат.Регистратор; 
				Рез.Приход = Результат.Регистратор.ДокОснование;
			Иначе
				Рез.Приход = Результат.Регистратор;
			КонецЕсли;	
		КонецЕсли;
		Рез.ТекСтатус = Результат.Статус;
		
		Если ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
			Рез.ХКМТек = Результат.Регистратор; 
			Рез.ТекДок = Результат.Регистратор.ДокОснование;
		Иначе
			Рез.ТекДок = Результат.Регистратор;
		КонецЕсли;
		
		к = к + 1;
	КонецЦикла; 
	Если (Рез.ТекСтатус = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте ИЛИ Рез.ТекСтатус = Перечисления.СтатусыКодовМаркировкиФакт.Карантин) И ТипЗнч(Рез.Приход) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Рез.МожноВ = Истина;
	КонецЕсли;	
	Возврат Рез;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РазделительGS1() Экспорт;
	
	Возврат Символ(29); // Dec 29
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика  
	Объект.ПричинаРекламации = Справочники.ПричиныРекламаций.НайтиПоКоду("OD7-0006");
	Если Объект.ВозвратныйДокумент = 0 Тогда
		Объект.ТипРекламации = Перечисления.ВидыРекламаций.Вычерк;
	Иначе
		Объект.ТипРекламации = Перечисления.ВидыРекламаций.Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИСоздатьДокументыНаСервере()
	// Вставить содержимое обработчика.
	ТЗВозвр = Объект.ВозвратБрака.Выгрузить();
	Запр = Новый Запрос; 
	Запр.Текст =
	"ВЫБРАТЬ
	|ТЗСтр.ШКУпаковки,         
	|ТЗСтр.Приход,         
	|ТЗСтр.ТекДок,
	|ТЗСтр.Номенклатура,
	|ТЗСтр.МожноВ 
	//|ТЗСтр.ОписН
	|ПОМЕСТИТЬ ВТ_ШК
	|ИЗ
	|	&ТЗ КАК ТЗСтр
	|; 
	|ВЫБРАТЬ
	|ВТ_ШК.ШКУпаковки,         
	|ВТ_ШК.Приход,         
	|ВТ_ШК.ТекДок,
	|ВТ_ШК.Номенклатура,
	|ВТ_ШК.МожноВ,
	|РекламационнаяНакладнаяШтрихкодыУпаковок.Ссылка КАК РКМ
	|
	|ИЗ
	|	ВТ_ШК КАК ВТ_ШК
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РекламационнаяНакладная.ШтрихкодыУпаковок КАК РекламационнаяНакладнаяШтрихкодыУпаковок
	|	ПО РекламационнаяНакладнаяШтрихкодыУпаковок.ШтрихкодУпаковки = ВТ_ШК.ШКУпаковки
	
	//|ВЫБРАТЬ
	//|	РекламационнаяНакладнаяШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	//|	РекламационнаяНакладнаяШтрихкодыУпаковок.Ссылка КАК Ссылка,
	//|	РекламационнаяНакладнаяШтрихкодыУпаковок.Товар КАК Товар
	//|ИЗ
	//|	Документ.РекламационнаяНакладная.ШтрихкодыУпаковок КАК РекламационнаяНакладнаяШтрихкодыУпаковок"
	
	|";   
	
	//|ВЫБРАТЬ
	//|	РекламационнаяНакладнаяШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	//|	РекламационнаяНакладнаяШтрихкодыУпаковок.Ссылка КАК Ссылка,
	//|	РекламационнаяНакладнаяШтрихкодыУпаковок.Товар КАК Товар
	//|ИЗ
	//|	Документ.РекламационнаяНакладная.ШтрихкодыУпаковок КАК РекламационнаяНакладнаяШтрихкодыУпаковок"
	
	Запр.УстановитьПараметр("ТЗ", ТЗВозвр);  
	ТЗРез = Запр.Выполнить().Выгрузить();
	СоотДок = Новый Соответствие;
	ТЗСв = ТЗРез.Скопировать();
	ТЗСв.Свернуть("Приход, РКМ");
	Для Каждого ТекСтр Из ТЗСв Цикл
		Если ТипЗнч(ТекСтр.Приход) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			ТекРКМ = ТекСтр.РКМ;
			СоздДок = Ложь;
			Если НЕ ЗначениеЗаполнено(ТекРКМ) Тогда
				СоздДок = Истина;	
			Иначе
				ТДокРКМ = ТекРКМ.ПолучитьОбъект();
				
				Если ТДокРКМ = Неопределено Тогда
					СоздДок = Истина;	
				КонецЕсли;
				
			КонецЕсли;	
			Если СоздДок Тогда	
				ДокРКМ = Документы.РекламационнаяНакладная.СоздатьДокумент();
				ДокРКМ.ИБ = ПолучитьИБПоУмолчанию(); 
				//Найды = ТЗС1.НайтиСтроки(Новый Структура("РНК", НовСтр.РНК));
				//ТД = ТекущаяДатаСеанса();
				//Если Найды.Количество() Тогда 
				//	Если Месяц(Найды[0].ПНК.Дата) = Месяц(ТД) Тогда
				//		ДокРКМ.Дата = Найды[0].ПНК.Дата;
				//	Иначе
				//		ДокРКМ.Дата = ТекущаяДатаСеанса();
				//	КонецЕсли;
				//Иначе
				ДокРКМ.Дата = ТекущаяДатаСеанса();
				ДокРКМ.Автор = ПараметрыСеанса.Пользователь;
				//КонецЕсли;
				ДокРКМ.ДокОснование = ТекСтр.Приход;
				ДокРКМ.Валюта = ТекСтр.Приход.Валюта;
				РКМОбработкаЗаполнения(ТекСтр.Приход, ДокРКМ);
				ДокРКМ.ВидРекламации = Объект.ТипРекламации;
				ДокРКМ.ПричинаРекламации = Объект.ПричинаРекламации;
				ДокРКМ.ПроводитьПоОстаткам = ?(ДокРКМ.ВидРекламации = Перечисления.ВидыРекламаций.Вычерк, Истина, Ложь); 
				//ДокРКМ.ЗаявкаНаВозвратОтПокупателя = Объект.ДокОбъект.Ссылка;
				УстановитьНомерДокументаКлиентСервер(ДокРКМ); 
				ДокРКМ.Склад = Объект.Склад;
				ДокРКМ.Записать();
								
				ТекРКМ = ДокРКМ.Ссылка; 
				//НовСтр.НовыйРКМ = Истина;
			Иначе 
				Если НЕ ТекРКМ.ВидРекламации = Объект.ТипРекламации ИЛИ НЕ (ТекРКМ.ПроводитьПоОстаткам = ?(ТекРКМ.ВидРекламации = Перечисления.ВидыРекламаций.Вычерк, Истина, Ложь)) Тогда
					ТекДокРКМ = ТекРКМ.ПолучитьОбъект();
					ТекДокРКМ.ВидРекламации = Объект.ТипРекламации;
					ТекДокРКМ.ПроводитьПоОстаткам = ?(ТекДокРКМ.ВидРекламации = Перечисления.ВидыРекламаций.Вычерк, Истина, Ложь);
					Если НЕ ТекДокРКМ.Подразделение = ТекДокРКМ.ДокОснование.Подразделение Тогда
						ТекДокРКМ.Подразделение = ТекДокРКМ.ДокОснование.Подразделение;
					КонецЕсли;	
					ТекДокРКМ.Записать();
				КонецЕсли;	
			КонецЕсли;	
			СоотДок.Вставить(ТекСтр.Приход, ТекРКМ);
		КонецЕсли;	
	КонецЦикла; 
	
	
	ТЗНом = Новый ТаблицаЗначений;	
	ТЗНом.Колонки.Добавить("Кол",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7)));
	ТЗНом.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	Для Каждого КлЗ Из СоотДок Цикл
		ТПНК = КлЗ.Ключ;
		ТРКМ = КлЗ.Значение;  
		ДокРКМ = ТРКМ.ПолучитьОбъект();
		Если 1=2 Тогда
			ДокРКМ = Документы.РекламационнаяНакладная.СоздатьДокумент();
		КонецЕсли;
		Найды = Объект.ВозвратБрака.НайтиСтроки(Новый Структура("Приход", ТПНК)); 
		
		
		
		
		//Если Найды.Количество() Тогда
		//	Если НЕ ЗначениеЗаполнено(Найды[0].РКМ) И ЗначениеЗаполнено(Найды[0].ПНК) И НЕ ЗначениеЗаполнено(ДокРКМ.ДокументВозврата) Тогда
		//		ДокРКМ.ДокументВозврата = Найды[0].ПНК;
		//	КонецЕсли;	
		//КонецЕсли;
		ТЗНом.Очистить();
		
		Для Каждого Найд Из Найды Цикл
			Если НЕ ЗначениеЗаполнено(Найд.ВозвратныйДок) Тогда
				
				
				Найд.ВозвратныйДок = ТРКМ;
				//Найд.РКМ_ПНК = ДокРКМ.ДокументВозврата;
			КонецЕсли;
			
			Найды1 = ДокРКМ.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", Найд.ШКУпаковки));
			Если Найды1.Количество() = 0 Тогда
				НовШК = ДокРКМ.ШтрихкодыУпаковок.Добавить();
				НовШК.Количество = 1;
				НовШК.СтатусУКонтрагента = Перечисления.СтатусыМарокУКонтаргента.Излишек; //???
				НовШК.ШтрихкодУпаковки = Найд.ШКУпаковки;
				НовШК.ШКМаркиКонтрагента = Найд.КодМаркировки; 
				НовШК.Товар = Найд.Номенклатура; 
				НовС = ТЗНом.Добавить();
				НовС.Кол = 1;
				НовС.Номенклатура = Найд.Номенклатура;
			КонецЕсли;	
			
		КонецЦикла;
		ТЗН = ТЗНом.Скопировать();
		ТЗН.Свернуть("Номенклатура", "Кол");  
		
		Для Каждого ТСтр Из ТЗН Цикл
			
			НовСТ = ДокРКМ.Товары.Добавить();
			НовСТ.Номенклатура = ТСтр.Номенклатура;
			НайдыНом = ТПНК.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТСтр.Номенклатура));  
			КолвоПНК = 0;
			ОбПНК = 0;
			Для Каждого НайдНом Из НайдыНом Цикл
				КолвоПНК = КолвоПНК + НайдНом.Количество;
				ОбПНК = ОбПНК + НайдНом.Объем;
			КонецЦикла;	
			НовСТ.КоличествоИсх = КолвоПНК;
			НовСТ.КоличествоФакт = КолвоПНК - ТСтр.Кол;
			НовСТ.Количество = ТСтр.Кол;
			НовСТ.Единица = НайдыНом[0].Единица;
			НовСТ.Коэффициент = НайдыНом[0].Коэффициент;
			НовСТ.Цена = НайдыНом[0].Цена;
			НовСТ.ЦенаБезСкидки = НайдыНом[0].ЦенаБезСкидки;
			НовСТ.СтавкаНДС = НайдыНом[0].СтавкаНДС; 
			НовСТ.Объем = Окр(ОбПНК * НовСТ.Количество/КолвоПНК, 3);
			НовСТ.Всего = НовСТ.Цена * НовСТ.Количество;
			НовСТ.ВсегоБезСкидки = НовСТ.ЦенаБезСкидки * НовСТ.Количество;
			ПСтавкаНДС=ПроцентНДСпоСтавке(НовСТ.СтавкаНДС);
			НовСТ.НДС = Окр(НовСТ.Всего*ПСтавкаНДС/(1+ПСтавкаНДС),2);
			НовСТ.Сумма = НовСТ.Всего - НовСТ.НДС;
			
		КонецЦикла;	
		Попытка
			ДокРКМ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокРКМ.Записать();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИСоздатьДокументы(Команда) 
	Если Объект.ВозвратБрака.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не заполнена таблица возвратов");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		ПоказатьПредупреждение(, "Не выбран склад");
		Возврат;
	КонецЕсли;
	ПроверитьИСоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РКМОбработкаЗаполнения(Основание,РКМ) 	
	
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	РКМ.ДокОснование	= Основание;
	
	
	// Катаев+ 19/03/13  Добавил заполнение на основании акта приемки
	
	РКМ.ПунктДоставки	= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"ПунктДоставки");			
	РКМ.Менеджер 		= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Менеджер");			
	РКМ.Организация		= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Организация");	
	РКМ.ТипЦен			= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"ТипЦен");
	РКМ.ТипСкидок		= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"ТипСкидок");
	
	РКМ.Менеджер			= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Менеджер");
	//крохин конец 29.01.2013
	
	РКМ.Комментарий		= ""+РКМ.ДокОснование.Метаданные()+" № " + РКМ.ДокОснование.Номер + " от " + Формат(РКМ.ДокОснование.Дата,"ДФ=dd.MM.yy");		
	
	Если ВидОснования="ПриходнаяНакладная" ИЛИ ВидОснования="РасходнаяНакладная" Тогда
		РКМ.Корреспондент	= РКМ.ДокОснование.Контрагент;		
		РКМ.Склад			= РКМ.ДокОснование.Склад; 
		РКМ.Подразделение			= РКМ.ДокОснование.Подразделение;
		//крохин начало 06.03.2012
		РКМ.ВидОплаты = РКМ.ДокОснование.ВидОплаты;
		//крохин конец 06.03.2012
		//крохин начало 24.05.2012
		РКМ.ДатаОплаты = РКМ.Докоснование.ДатаОплаты;
		//крохин конец 24.05.2012
	ИначеЕсли ВидОснования="Перемещение" Тогда
		РКМ.Корреспондент	= РКМ.ДокОснование.СкладПолучатель;
		РКМ.Склад			= РКМ.ДокОснование.Склад;
		// Катаев+ 19/03/13 
	ИначеЕсли Видоснования="АктПриемки"	 Тогда
		РКМ.Корреспондент	= РКМ.ДокОснование.Контрагент;		
		РКМ.Склад			= РКМ.ДокОснование.Склад;
		РКМ.ДатаОплаты = РКМ.ДокОснование.РНК.ДатаОплаты;
		//Катаев- 19/03/13
	Иначе
		РКМ.Склад			= ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Склад");		
	КонецЕсли;	
	
	РКМ.договор = ПолучитьРеквизитОбъекта(РКМ.ДокОснование,"Договор");
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратныйДокументПриИзменении(Элемент)
	// Вставить содержимое обработчика. 
	Если Объект.ВозвратныйДокумент = 0 Тогда
		Объект.ТипРекламации = Перечисления.ВидыРекламаций.Вычерк;
	Иначе
		Объект.ТипРекламации = Перечисления.ВидыРекламаций.Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПНКПриИзмененииНаСервере()
	// Вставить содержимое обработчика. 
	ТЗШК.Очистить();
	Запр = Новый Запрос;
	Запр.Текст  = 
	"ВЫБРАТЬ
	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШКУпаковки,
	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец.Ссылка КАК Номенклатура,
	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК КодМаркировки
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
	|ГДЕ
	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.ДокОснование = &ПНК";
	Запр.УстановитьПараметр("ПНК", ПНК); 
	Выб = Запр.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		НовС = ТЗШК.Добавить();
		ЗаполнитьЗначенияСвойств(НовС, Выб);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПНКПриИзменении(Элемент)
	ПНКПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВВозвраты(Команда)
	// Вставить содержимое обработчика.   
	//Элементы.ТЗШК.ТекущиеДанные. 
	МассивОбъектов = Новый Массив;
	Если (Элементы.ТЗШК.ВыделенныеСтроки.Количество()) Тогда
		
		Для Каждого ТС Из Элементы.ТЗШК.ВыделенныеСтроки Цикл
			//ТекСтр = Элементы.ТЗШКЧЗ.ДанныеСтроки(ТС);
			МассивОбъектов.Добавить(ТС);
			
			
		КонецЦикла;

	КонецЕсли;
	ПеренестиВВозвратыСервер(МассивОбъектов);	
	
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиВВозвратыСервер(МассивОбъектов)
	// Вставить содержимое обработчика. 
	Для Каждого Идент Из МассивОбъектов Цикл
		ТС = ТЗШК.НайтиПоИдентификатору(Идент);
		ШтрихКодУпаковки = ТС.ШКУпаковки;
		//ТС.ТекущиеДанные.ШКУпаковки;
		СтрокаШтрихКодаУпаковки = Объект.ВозвратБрака.Добавить(); 
		СтрокаШтрихКодаУпаковки.ШКУпаковки 	= ШтрихКодУпаковки;	
		СтрокаШтрихКодаУпаковки.КодМаркировки 	= ШтрихКодУпаковки.ЗначениеШтрихкода;
		СтрСтат = ЗапросСтатусШКУпаковки(ШтрихКодУпаковки);
		СтрокаШтрихКодаУпаковки.Номенклатура = СтрСтат.Номенклатура;
		СтрокаШтрихКодаУпаковки.НачСтатус = СтрСтат.НачСтатус;
		СтрокаШтрихКодаУпаковки.ТекСтатус = СтрСтат.ТекСтатус;
		СтрокаШтрихКодаУпаковки.ХКМПриход = СтрСтат.ХКМПриход; 
		СтрокаШтрихКодаУпаковки.Приход = СтрСтат.Приход; 
		СтрокаШтрихКодаУпаковки.ХКМТек = СтрСтат.ХКМТек;
		СтрокаШтрихКодаУпаковки.ТекДок = СтрСтат.ТекДок;
		СтрокаШтрихКодаУпаковки.МожноВ = СтрСтат.МожноВ;
		//МассивОбъектов1.Добавить(Объект.ТЗНом.НайтиПоИдентификатору(Идент));
	КонецЦикла;
КонецПроцедуры


//Для Каждого ТекСтр Из ТЗС Цикл
//	
//		
//	НовСтр = РНКРКМ.Добавить();
//	НовСтр.РНК = ТекСтр.РНК;
//	Найды1 = ТЗС2.НайтиСтроки(Новый Структура("РНК", НовСтр.РНК));
//	ТекРКМ = Неопределено;
//	Для Каждого Найд1 Из Найды1 Цикл
//		Если ЗначениеЗаполнено(Найд1.РКМ) Тогда
//			ТекРКМ = Найд1.РКМ;
//			НовСтр.РКМ = ТекРКМ;
//		КонецЕсли;	
//	КонецЦикла;	
//	Если ТекРКМ = Неопределено Тогда
//		ДокРКМ = Документы.РекламационнаяНакладная.СоздатьДокумент();
//		ДокРКМ.ИБ = ПолучитьИБПоУмолчанию(); 
//		Найды = ТЗС1.НайтиСтроки(Новый Структура("РНК", НовСтр.РНК));
//		ТД = ТекущаяДатаСеанса();
//		Если Найды.Количество() Тогда 
//			Если Месяц(Найды[0].ПНК.Дата) = Месяц(ТД) Тогда
//				ДокРКМ.Дата = Найды[0].ПНК.Дата;
//			Иначе
//				ДокРКМ.Дата = ТекущаяДатаСеанса();
//			КонецЕсли;
//		Иначе
//			ДокРКМ.Дата = ТекущаяДатаСеанса();
//		КонецЕсли;
//		ДокРКМ.ДокОснование = ТекСтр.РНК;
//		ДокРКМ.Валюта = ТекСтр.РНК.Валюта;
//		РКМОбработкаЗаполнения(ТекСтр.РНК, ДокРКМ);
//		ДокРКМ.ВидРекламации = Перечисления.ВидыРекламаций.Возврат;
//		ДокРКМ.ЗаявкаНаВозвратОтПокупателя = Объект.ДокОбъект.Ссылка;
//		УстановитьНомерДокументаКлиентСервер(ДокРКМ);
//		ДокРКМ.Записать();
//		НовСтр.РКМ = ДокРКМ.Ссылка; 
//		НовСтр.НовыйРКМ = Истина;
//	КонецЕсли;
//	СоотДок.Вставить(НовСтр.РНК, НовСтр.РКМ);
//КонецЦикла;
